Ran Plan for project: `environments` dir: `environments/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 4.45.0"...
- Installing hashicorp/aws v4.45.0...
- Installed hashicorp/aws v4.45.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_eip.nat_eip: Refreshing state... [id=eipalloc-01eeb0a9043b47347]
aws_vpc.eks_vpc: Refreshing state... [id=vpc-0dd6972bfe4c3b518]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ce48bcfbdfd323b4]
aws_route_table.public_route: Refreshing state... [id=rtb-05dcc8880ea8e976c]
aws_route_table.private_route: Refreshing state... [id=rtb-07b5fcc7598794d5d]
aws_security_group.default_group: Refreshing state... [id=sg-0d894644a9951d1e0]
aws_route.public_igw: Refreshing state... [id=r-rtb-05dcc8880ea8e976c1080289494]
aws_security_group_rule.ing_http_rules: Refreshing state... [id=sgrule-2987789509]
aws_security_group_rule.default_egress_rule: Refreshing state... [id=sgrule-1400488733]
aws_security_group_rule.ing_ssh_rules: Refreshing state... [id=sgrule-77353328]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = "eipalloc-01eeb0a9043b47347"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Test-Dev-nat-gw"
        }
      + tags_all             = {
          + "Name" = "Test-Dev-nat-gw"
        }
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-07b5fcc7598794d5d"
      + state                  = (known after apply)
    }

  # aws_route_table_association.private_assoc[0] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-07b5fcc7598794d5d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_assoc[1] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-07b5fcc7598794d5d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[0] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-05dcc8880ea8e976c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[1] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-05dcc8880ea8e976c"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.eks_private_subnets[0] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-us-east-1a"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_private_subnets[1] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-us-east-1b"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_public_subnets[0] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-us-east-1a"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_public_subnets[1] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-us-east-1b"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

# aws_eip.nat_eip:
resource "aws_eip" "nat_eip" {
    allocation_id        = "eipalloc-01eeb0a9043b47347"
    domain               = "vpc"
    id                   = "eipalloc-01eeb0a9043b47347"
    network_border_group = "us-east-1"
    public_dns           = "ec2-54-156-21-201.compute-1.amazonaws.com"
    public_ip            = "54.156.21.201"
    public_ipv4_pool     = "amazon"
    tags                 = {
        "Name" = "Test-Dev-nat-eip"
    }
    tags_all             = {
        "Name" = "Test-Dev-nat-eip"
    }
    vpc                  = true
}

# aws_internet_gateway.igw:
resource "aws_internet_gateway" "igw" {
    arn      = "arn:aws:ec2:us-east-1:455015786856:internet-gateway/igw-0ce48bcfbdfd323b4"
    id       = "igw-0ce48bcfbdfd323b4"
    owner_id = "455015786856"
    tags     = {
        "Name" = "Test-Dev-igw"
    }
    tags_all = {
        "Name" = "Test-Dev-igw"
    }
    vpc_id   = "vpc-0dd6972bfe4c3b518"
}

# aws_route.public_igw:
resource "aws_route" "public_igw" {
    destination_cidr_block = "0.0.0.0/0"
    gateway_id             = "igw-0ce48bcfbdfd323b4"
    id                     = "r-rtb-05dcc8880ea8e976c1080289494"
    origin                 = "CreateRoute"
    route_table_id         = "rtb-05dcc8880ea8e976c"
    state                  = "active"
}

# aws_route_table.private_route:
resource "aws_route_table" "private_route" {
    arn              = "arn:aws:ec2:us-east-1:455015786856:route-table/rtb-07b5fcc7598794d5d"
    id               = "rtb-07b5fcc7598794d5d"
    owner_id         = "455015786856"
    propagating_vgws = []
    route            = []
    tags             = {
        "Name" = "Test-Dev-private-rt"
    }
    tags_all         = {
        "Name" = "Test-Dev-private-rt"
    }
    vpc_id           = "vpc-0dd6972bfe4c3b518"
}

# aws_route_table.public_route:
resource "aws_route_table" "public_route" {
    arn              = "arn:aws:ec2:us-east-1:455015786856:route-table/rtb-05dcc8880ea8e976c"
    id               = "rtb-05dcc8880ea8e976c"
    owner_id         = "455015786856"
    propagating_vgws = []
    route            = []
    tags             = {
        "Name" = "Test-Dev-public-rt"
    }
    tags_all         = {
        "Name" = "Test-Dev-public-rt"
    }
    vpc_id           = "vpc-0dd6972bfe4c3b518"
}

# aws_security_group.default_group:
resource "aws_security_group" "default_group" {
    arn                    = "arn:aws:ec2:us-east-1:455015786856:security-group/sg-0d894644a9951d1e0"
    description            = "Default Secuirty Group for EKS VPC Network"
    egress                 = []
    id                     = "sg-0d894644a9951d1e0"
    ingress                = []
    name                   = "Test-Dev-default-sg"
    owner_id               = "455015786856"
    revoke_rules_on_delete = false
    tags                   = {
        "Name" = "Test-Dev-default-sg"
    }
    tags_all               = {
        "Name" = "Test-Dev-default-sg"
    }
    vpc_id                 = "vpc-0dd6972bfe4c3b518"
}

# aws_security_group_rule.default_egress_rule:
resource "aws_security_group_rule" "default_egress_rule" {
    cidr_blocks            = [
        "0.0.0.0/0",
    ]
    from_port              = 0
    id                     = "sgrule-1400488733"
    protocol               = "-1"
    security_group_id      = "sg-0d894644a9951d1e0"
    security_group_rule_id = "sgr-0581d0f86ec06dc71"
    self                   = false
    to_port                = 0
    type                   = "egress"
}

# aws_security_group_rule.ing_http_rules:
resource "aws_security_group_rule" "ing_http_rules" {
    cidr_blocks            = [
        "0.0.0.0/0",
    ]
    from_port              = 80
    id                     = "sgrule-2987789509"
    protocol               = "tcp"
    security_group_id      = "sg-0d894644a9951d1e0"
    security_group_rule_id = "sgr-0d32abfe1010e9acc"
    self                   = false
    to_port                = 80
    type                   = "ingress"
}

# aws_security_group_rule.ing_ssh_rules:
resource "aws_security_group_rule" "ing_ssh_rules" {
    cidr_blocks            = [
        "0.0.0.0/0",
    ]
    from_port              = 22
    id                     = "sgrule-77353328"
    protocol               = "tcp"
    security_group_id      = "sg-0d894644a9951d1e0"
    security_group_rule_id = "sgr-04551a3fed6d0e403"
    self                   = false
    to_port                = 22
    type                   = "ingress"
}

# aws_vpc.eks_vpc:
resource "aws_vpc" "eks_vpc" {
    arn                                  = "arn:aws:ec2:us-east-1:455015786856:vpc/vpc-0dd6972bfe4c3b518"
    assign_generated_ipv6_cidr_block     = false
    cidr_block                           = "10.10.0.0/16"
    default_network_acl_id               = "acl-0fac29e3c71e69551"
    default_route_table_id               = "rtb-041d759810643229c"
    default_security_group_id            = "sg-0d2d85d0f1a28f399"
    dhcp_options_id                      = "dopt-0774fce3145f13f4c"
    enable_classiclink                   = false
    enable_classiclink_dns_support       = false
    enable_dns_hostnames                 = true
    enable_dns_support                   = true
    enable_network_address_usage_metrics = false
    id                                   = "vpc-0dd6972bfe4c3b518"
    instance_tenancy                     = "default"
    ipv6_netmask_length                  = 0
    main_route_table_id                  = "rtb-041d759810643229c"
    owner_id                             = "455015786856"
    tags                                 = {
        "Name" = "Test-Dev-vpc"
    }
    tags_all                             = {
        "Name" = "Test-Dev-vpc"
    }
}

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p environments`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=Jeevaann%252Fterragrunt-multi-env-management%252Fenvironments%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p environments`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
